chicago_food_inspection.csv

In [128]:
import  pandas as pd

food = pd.read_csv('./datasets/task_2/chicago_food_inspections.csv')
print(food)

                                      Name             Risk
0               MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                              JETS PIZZA   Risk 2 (Medium)
2                               ROOM 1520      Risk 3 (Low)
3                MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                            CHARTWELLS       Risk 1 (High)
...                                    ...              ...
153805                         WOLCOTT'S      Risk 1 (High)
153806     DUNKIN DONUTS/BASKIN-ROBBINS     Risk 2 (Medium)
153807                           Cafe 608     Risk 1 (High)
153808                        mr.daniel's     Risk 1 (High)
153809                         TEMPO CAFE     Risk 1 (High)

[153810 rows x 2 columns]

1. strip whitespaces

In [129]:
food['Name'] = food['Name'].str.strip()
print(food)

                                Name             Risk
0            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
1                         JETS PIZZA  Risk 2 (Medium)
2                          ROOM 1520     Risk 3 (Low)
3            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
4                         CHARTWELLS    Risk 1 (High)
...                              ...              ...
153805                     WOLCOTT'S    Risk 1 (High)
153806  DUNKIN DONUTS/BASKIN-ROBBINS  Risk 2 (Medium)
153807                      Cafe 608    Risk 1 (High)
153808                   mr.daniel's    Risk 1 (High)
153809                    TEMPO CAFE    Risk 1 (High)

[153810 rows x 2 columns]

2. change the case to lowercase when the Risk is Risk 1

In [130]:
f1 = food
f2 = food
food

                                Name             Risk
0            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
1                         JETS PIZZA  Risk 2 (Medium)
2                          ROOM 1520     Risk 3 (Low)
3            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
4                         CHARTWELLS    Risk 1 (High)
...                              ...              ...
153805                     WOLCOTT'S    Risk 1 (High)
153806  DUNKIN DONUTS/BASKIN-ROBBINS  Risk 2 (Medium)
153807                      Cafe 608    Risk 1 (High)
153808                   mr.daniel's    Risk 1 (High)
153809                    TEMPO CAFE    Risk 1 (High)

[153810 rows x 2 columns]

with string function

In [131]:
f1.loc[f1['Risk'] == 'Risk 1 (High)', 'Name'] = f1['Name'].str.lower()
print(f1)

                                Name             Risk
0            marriot marquis chicago    Risk 1 (High)
1                         JETS PIZZA  Risk 2 (Medium)
2                          ROOM 1520     Risk 3 (Low)
3            marriot marquis chicago    Risk 1 (High)
4                         chartwells    Risk 1 (High)
...                              ...              ...
153805                     wolcott's    Risk 1 (High)
153806  DUNKIN DONUTS/BASKIN-ROBBINS  Risk 2 (Medium)
153807                      cafe 608    Risk 1 (High)
153808                   mr.daniel's    Risk 1 (High)
153809                    tempo cafe    Risk 1 (High)

[153810 rows x 2 columns]

In [132]:
# f1.loc[f1['Risk'].str[5:6] == '1', 'Name'] = f1['Name'].str.lower()
# f1

with apply function

In [133]:
def change_case(row):
    if row['Risk'] == 'Risk 1 (High)':
        return row['Name'].lower()
    else:
        return row['Name']

# Apply the function to the 'Name' column
f2['Name'] = f2.apply(change_case, axis=1)
f2

                                Name             Risk
0            marriot marquis chicago    Risk 1 (High)
1                         JETS PIZZA  Risk 2 (Medium)
2                          ROOM 1520     Risk 3 (Low)
3            marriot marquis chicago    Risk 1 (High)
4                         chartwells    Risk 1 (High)
...                              ...              ...
153805                     wolcott's    Risk 1 (High)
153806  DUNKIN DONUTS/BASKIN-ROBBINS  Risk 2 (Medium)
153807                      cafe 608    Risk 1 (High)
153808                   mr.daniel's    Risk 1 (High)
153809                    tempo cafe    Risk 1 (High)

[153810 rows x 2 columns]

In [134]:
f1 == f2

        Name  Risk
0       True  True
1       True  True
2       True  True
3       True  True
4       True  True
...      ...   ...
153805  True  True
153806  True  True
153807  True  True
153808  True  True
153809  True  True

[153810 rows x 2 columns]